<template>
  <div class="text-center">
    <v-dialog v-model="dialog" persistent scrollable max-height="100vh">
      <v-card>
        <v-toolbar color="grey lighten-2">
          <v-toolbar-title class="px-0">นโยบายคุ้มครองข้อมูลส่วนบุคคล</v-toolbar-title>
          <v-spacer></v-spacer>
          <v-btn icon @click="close">
            <v-icon>mdi-close</v-icon>
          </v-btn>
        </v-toolbar>

        <v-card-text class="mt-4">
          <div>
            <ol>
              <li>
                <strong><u>ทั่วไป </u></strong>
              </li>
            </ol>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; บริษัท
              มิกซ์เซี่ยนฟู้ดส์ จำกัด (&ldquo;บริษัท&rdquo;)
              จะเป็นผู้ให้บริการดำเนินการเก็บรวบรวมข้อมูลเกี่ยวกับบุคคล
              (&ldquo;ข้อมูลส่วนบุคคล&rdquo;)
              เพื่อให้บริการในการใช้แต้มคะแนนเพื่อแลกเครื่องดื่ม หรือส่วนลด
              หรือสิทธิพิเศษจากการที่ผู้ใช้บริการหรือลูกค้าซื้อเครื่องดื่มของแบรนด์ดาคาซี่ผ่านช่องทาง
              Customer Relationship Management (CRM Application) (ต่อไปนี้รวมเรียกว่า
              &ldquo;บริการ&rdquo;)
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              นโยบายคุ้มครองข้อมูลส่วนบุคคลฉบับนี้
              อธิบายถึงประเภทของข้อมูลส่วนบุคคลที่เราทำการเก็บรวบรวม การใช้
              การเปิดเผยข้อมูลส่วนบุคคล
              และวิธีการที่ท่านสามารถจัดการข้อมูลส่วนบุคคลของท่าน
            </p>
            <ol start="2">
              <li>
                <strong><u>ข้อมูลส่วนบุคคล</u></strong>
              </li>
            </ol>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ข้อมูลส่วนบุคคล
              หมายถึง ข้อมูลเกี่ยวกับบุคคลซึ่งสามารถระบุตัวบุคคลนั้นได้
              ไม่ว่าทางตรงหรือทางอ้อม
            </p>
            <ol start="3">
              <li>
                <strong><u>ข้อกำหนดและเงื่อนไขการใช้บริการ</u></strong>
              </li>
            </ol>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              การเข้าถึงหรือใช้บริการ Customer Relationship Management (CRM
              Application)<br />
              (&ldquo;แอปพลิเคชัน&rdquo;) ภายใต้การควบคุมดูแลของบริษัท รวมถึงบริษัทสาขา
              บริษัทในเครือ กิจการที่บริษัทฯ เป็นหุ้นส่วน บริษัทย่อย ตัวแทน
              พนักงานเจ้าหน้าที่หรือผู้ที่ได้รับมอบอำนาจ รวมเรียกว่า &ldquo;บริษัทฯ&rdquo;
              ท่านยอมรับข้อกำหนดและเงื่อนไขที่ปรากฏบนแอปพลิเคชั่นว่ามีผลผูกพันตามกฎหมาย
              (&ldquo;เงื่อนไข&rdquo;)
              และท่านยังยอมรับนโยบายการคุ้มครองข้อมูลส่วนบุคคลของแอปพลิเคชั่น
              และยอมรับที่จะปฏิบัติตามกฎระเบียบ<br />
              อื่น ๆ บนแอปพลิเคชั่น เช่น วิธีการใช้ วิธีปฏิบัติและขั้นตอน
              หรือเงื่อนไขสำหรับการเข้าถึงหรือการใช้บริการของแอปพลิเคชั่น
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              โดยที่บริษัทเป็นผู้ให้บริการแพลตฟอร์มในการเป็นสื่อกลางเพื่อให้เกิดการสื่อสาร
              หรือร่วมกิจกรรมระหว่างผู้ใช้บริการแพลตฟอร์มกับบุคคลผู้เชี่ยวชาญที่เกี่ยวข้องอื่น
              ๆ อีกด้วย
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; คำนิยาม
              เพื่อวัตถุประสงค์ของข้อกำหนดและเงื่อนไขการใช้บริการนี้  "Digital Content"
              หมายถึง เนื้อหาใด ๆ ที่ปรากฏอยู่ในช่องทาง Customer Relationship Management
              (CRM Application) แอปพลิเคชั่น CRM รวมไปถึง digital content อื่น ๆ
              ที่ให้บริการ 
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; " &nbsp;Customer
              Relationship Management (CRM Application) " มีความหมายถึง LINE Official
              Account &ndash; ของดาคาซี่ แอปพลิเคชั่น CRM และ/หรือ ระบบซอฟท์แวร์
              (รวมถึงการอัพเดตหรืออัพเกรด<br />
              ต่าง ๆ ในซอฟท์แวร์นั้น ๆ) ที่เป็นของบริษัทฯ รวมกันทั้งหมด ซึ่งท่านสามารถ
              เข้าใช้ค้นหา ดาวน์โหลด และ/หรือ สตรีม (ส่งผ่านข้อมูล) อ่าน และ/หรือ ใช้
              Digital Content หรือสิ่งอื่น ๆ ที่ทางเราเสนอสำหรับการใช้ในอุปกรณ์ที่เลือก
              (หนึ่งรูปแบบหรือมากกว่านั้น เช่น สมาร์ทโฟน แท็บเล็ต พีซี/แมค เป็นต้น)
              และจัดการ Digital Content และการตั้งค่าบัญชีของท่าน
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; เงื่อนไขโดยทั่วไป
              เมื่อท่านใช้บริการผ่านช่องทาง LINE Official Account &ndash; ดาคาซี่
              แอปพลิเคชั่น CRM Customer Relationship Management หมายถึง
              ท่านยอมรับข้อตกลงและเงื่อนไขทั้งหมดในการใช้บริการ
              กรุณาอ่านข้อตกลงและเงื่อนไขอย่างละเอียด การสร้างบัญชีหรือใช้บริการผ่าน
              เว็บไซต์และแอปพลิเคชั่น ถือว่าท่านได้อ่าน เข้าใจ
              ยินยอมและตกลงที่จะปฏิบัติตามข้อตกลงและเงื่อนไขบริการ
              รวมถึงระเบียบและข้อกฎหมายที่เกี่ยวข้อง (รวมเรียกว่า &ldquo;ข้อตกลง&rdquo;
              หรือ &ldquo;เงื่อนไข&rdquo;) นอกจากนี้การใช้บริการผ่านช่องทาง LINE Official
              Account &ndash; ดาคาซี่ แอปพลิเคชั่น Customer Relationship Management (CRM
              Application)
              &nbsp;รวมถึงช่องทางอื่นใดที่มีหรือจะมีขึ้นในอนาคตภายใต้การควบคุมหรือดูแลโดยบริษัทฯ
              (รวมเรียกว่า &ldquo; ช่องทาง Customer Relationship Management (CRM
              Application)&rdquo; &ldquo;บริการ&rdquo; หรือ แอปพลิเคชั่น&rdquo;) หมายถึง
              ท่านยอมรับเงื่อนไขที่ปรากฏบนแอปพลิเคชั่นว่ามีผลผูกพันตามกฎหมาย
              และยอมรับนโยบายความเป็นส่วนตัวของบริษัทฯ พร้อมทั้งจะปฏิบัติตามกฎระเบียบอื่น
              ๆ บนแอปพลิเคชั่น เช่น วิธีการใช้ วิธีปฏิบัติ หรือขั้นตอนของการใช้บริการ
              ทั้งนี้ บริษัทฯ สงวนสิทธิโดยไม่ต้องแจ้งให้ท่านทราบล่วงหน้าถึงการเปลี่ยนแปลง
              แก้ไข ระงับ หรือยกเลิกข้อตกลงหรือเงื่อนไข กฎหมายที่ใช้บังคับ
              ข้อกำหนดตามกฎระเบียบหรือการรักษาความปลอดภัย
            </p>
            <ol start="4">
              <li>
                <strong><u>ข้อมูลส่วนบุคคลที่เราเก็บรวบรวม</u></strong>
              </li>
            </ol>
            <p>เราจะเก็บรวบรวมข้อมูลส่วนบุคคลดังต่อไปนี้</p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 4.1
              ข้อมูลส่วนตัวของผู้ใช้บริการ เช่น
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              - ชื่อ
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              - เบอร์โทรศัพท์มือถือ
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              - เพศ
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              - อายุ
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              -จังหวัด
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 4.2
              ข้อมูลที่เกี่ยวข้องกับสถานการณ์ใช้บริการฯของเรา เช่น ข้อความ รูปภาพ วิดิโอ
              และเนื้อหา<br />
              อื่น ๆ ที่ท่านเป็นผู้ตอบ ส่ง หรือโพสต์ และข้อมูลการเข้าสู่ระบบของท่าน
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              เราจะทำการเก็บรวบรวมข้อมูลส่วนบุคคลประเภทดังไปนี้เพื่อประโยชน์ในการให้บริการฯ
              หากท่านไม่สามารถให้ข้อมูลบางประเภทที่จำเป็นต่อการลงทะเบียนเพื่อใช้บริการฯ
              เช่น หมายเลขโทรศัพท์ หรือข้อมูลเกี่ยวกับบัญชีไลน์ของท่าน (&ldquo;LINE
              ID&rdquo;) ท่านอาจไม่สามารถใช้บริการฯ ของเราได้ทั้งหมด
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            </p>
            <ol start="5">
              <li>
                <strong><u>แหล่งที่มาของข้อมูลส่วนบุคคล</u></strong>
              </li>
            </ol>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              เราอาจได้รับข้อมูลส่วนบุคคลจากท่านโดยตรง
              โดยเราจะเก็บรวบรวมข้อมูลส่วนบุคคลของท่านจากขั้นตอนการให้บริการดังนี้
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              ขั้นตอนการสมัครใช้บริการกับเรา&nbsp; หรือขั้นตอนการยื่นคำร้องขอใช้สิทธิต่าง
              ๆ กับเรา
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              ก่อนเริ่มใช้บริการฯ เราอาจขอให้ท่านสมัครสมาชิกผ่านระบบ URL Link
              โดยกดลิงค์และเพิ่มเพื่อนชื่อบัญชีของดาคาซี่ ไทยแลนด์
              โดยที่ท่านจะต้องให้ข้อมูลการติดต่อของท่านเพื่อสร้างบัญชีในระบบCustomer
              Relationship Management (CRM Application) (&ldquo;บัญชี&rdquo;) เช่น
              ในการสร้างบัญชี&nbsp; ท่านจะต้องลงทะเบียนโดยใช้ชื่อ หมายเลขโทรศัพท์ ฯลฯ
              และเราจะทำระบบ OTP เพื่อยืนยันตัวตน
              ทั้งนี้เราจะไม่เก็บรวบรวมหรือจัดเก็บรหัสผ่านดังกล่าว
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              กรณีที่ท่านต้องการเข้าถึงบัญชีของท่านจากอุปกรณ์มากกว่าหนึ่งอุปกรณ์
              หรือต้องการโอนบัญชีของท่านจากอุปกรณ์เครื่องหนึ่งไปยังอีกอุปกรณ์หนึ่ง
              ท่านอาจมีความจำเป็นที่จะต้องลงทะเบียนหมายเลขโทรศัพท์หรือที่อยู่อีเมล์ของท่านเพิ่มเติมจากข้อมูลที่ท่านลงทะเบียนไว้ในขณะที่ท่านสร้างบัญชี
            </p>
            <ol start="6">
              <li>
                <strong><u>วิธีการเก็บข้อมูลส่วนบุคคล</u></strong>
              </li>
            </ol>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              &nbsp;บริษัทจะเก็บข้อมูลต่อไปนี้ โดยมีวัตถุประสงค์เพื่อความสะดวกในการใช้งาน
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 6.1
              ข้อมูลที่ส่งจากผู้ใช้โดยตรง ในขณะที่ลงทะเบียนหรือใช้บริการในไลน์
              แอปพลิเคชั่น
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 6.2
              ข้อมูลที่แจ้งกับบริษัทไว้โดยบริษัทในเครือ
            </p>
            <ol start="7">
              <li>
                <strong><u>วัตถุประสงค์ของการประมวลข้อมูล</u></strong>
              </li>
            </ol>
            <p>บริษัทจะใช้ข้อมูลที่เก็บรวบรวมเพื่อวัตถุประสงค์ ดังต่อไปนี้</p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 7.1
              เพื่อเก็บสะสมแต้มคะแนนเพื่อแลกเครื่องดื่ม หรือ รับสิทธิประโยชน์ หรือ
              ส่วนลดจากทาง&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ร้านค้า
            </p>
            <p>7.2 เพื่อช่วยให้ผู้ใช้บริการสามารถใช้บริการได้อย่างราบรื่นมากขึ้น</p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 7.3
              เพื่อจำแนกผู้ใช้และป้องกันการใช้งานที่ไม่เหมาะสมในแอปพลิเคชั่น
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 7.4
              เพื่อใช้ในการสร้างข้อมูลสถิติที่เกี่ยวข้องกับการใช้งานบริการ
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 7.5
              เพื่อดำเนินการสำรวจและการวิเคราะห์สำหรับการปรับปรุงการให้บริการ
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 7.6
              เพื่อยืนยันตัวตนของผู้ใช้
              เมื่อบริษัทได้รับการสอบถามและเพื่อให้บริษัทสามารถตอบกลับได้
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 7.7
              เพื่อใช้ในการส่งการแจ้งเตือนที่สำคัญเมื่อจำเป็น
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 7.8
              เพื่อเผยแพร่โฆษณาสำหรับกิจกรรมส่งเสริมการตลาดที่จะเกิดขึ้น
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 7.9
              เพื่อรักษาความปลอดภัยหรือป้องกันการเข้าถึงโดยไม่ได้รับอนุญาต
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 7.10
              เพื่อนำเสนอสินค้า บริการ และวิธีการใช้งานที่ดีและเหมาะสมแก่ท่าน
            </p>
            <ol start="8">
              <li>
                <strong><u>การประมวลผลข้อมูลส่วนบุคคล</u></strong>
              </li>
            </ol>
            <p>
              <strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </strong
              >เมื่อเราได้รับข้อมูลส่วนบุคคลจากแหล่งที่มาของข้อมูลส่วนบุคคลแล้ว
              เราจะดำเนินการดังนี้กับข้อมูลส่วนบุคคลของท่าน
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; -เก็บรวบรวมข้อมูล
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; -ใช้เพื่อสะสมแต้ม
              เพื่อแลกเครื่องดื่มฟรี หรือ รับส่วนลด หรือของพรีเมี่ยมจากทางร้านดาคาซี่
            </p>
            <ol start="9">
              <li>
                <strong><u>การแบ่งปันและการให้ข้อมูลส่วนบุคคล</u></strong>
              </li>
            </ol>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; โดยทั่วไปแล้ว
              เราจะไม่เปิดเผยหรือแชร์ข้อมูลของท่านให้แก่บุคคลภายนอกโดยไม่ได้รับความยินยอมจากท่าน
              หรือเป็นการปฏิบัติตามกฎหมายที่มีผลบังคับใช้ ยกเว้นการเปิดเผยข้อมูลของผู้ใช้
              ดังต่อไปนี้
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 9.1
              เมื่อผู้ใช้ได้ตกลงและยินยอมที่จะเปิดเผยหรือแบ่งปันข้อมูลของตนเอง
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 9.2
              เมื่อมีคำสั่งทางกฎหมาย
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 9.3 สิทธิของผู้ใช้
              ที่มอบอำนาจให้ผู้แทนทางกฎหมายดำเนินการแทนผู้ใช้
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 9.4
              ผู้ใช้บริการและผู้แทนทางกฎหมายของผู้ใช้บริการสามารถเรียกดูข้อมูลส่วนบุคคลเมื่อใดหรือแก้ไขข้อมูลส่วนบุคคลของผู้ใช้บริการและผู้แทนทางกฎหมายของผู้ใช้บริการที่ลงทะเบียนไว้
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 9.5
              ผู้ใช้บริการและผู้แทนทางกฎหมายของผู้ใช้บริการที่มีอายุน้อยกว่า 14 ปี
              อาจขอให้ลบบัญชีได้
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 9.6
              เมื่อผู้ใช้บริการขอแก้ไขเปลี่ยนแปลงข้อมูลส่วนบุคคลที่ไม่ถูกต้อง
              บริษัทจะไม่ใช้หรือให้ข้อมูลส่วนบุคคลแก่บุคคลที่สามจนกว่าจะได้รับการแก้ไข
              นอกจากนี้หากข้อมูลส่วนบุคคลที่ไม่ถูกต้องได้ถูกให้แก่บุคคลที่สามไปแล้ว
              บริษัทจะแจ้งให้บุคคลที่สามทราบถึงการแก้ไขทันที
              เพื่อที่จะทำการตรวจสอบให้แน่ใจว่าข้อมูลที่ได้รับนั้นถูกต้องหรือไม่
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 9.7
              การเปิดเผยข้อมูลส่วนบุคคลโดยได้รับการยกเว้นตามมาตรา 24 หรือ มาตรา 26
              แห่งพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
            </p>
            <p>&nbsp;</p>
            <ol start="10">
              <li>
                <strong
                  ><u>การเก็บรักษาและระยะเวลาในการเก็บรักษาข้อมูลส่วนบุคคล</u></strong
                >
              </li>
            </ol>
            <p>
              <strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </strong
              >ผู้ควบคุมทำการเก็บรักษาข้อมูลส่วนบุคคลของท่าน ดังนี้
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 10.1&nbsp;
              ลักษณะการเก็บ เราจะทำการเก็บข้อมูลเป็น Soft Copy
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 10.2&nbsp;
              สถานที่จัดเก็บ เราจะทำการเก็บข้อมูลไว้บน Cloud ที่ใช้บริการกับ Microsoft
              &nbsp;Window Cloud Software บริษัท Internet Thailand
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 10.3&nbsp;
              ระยะเวลาการจัดเก็บ 10 ปี นับแต่วันที่เลิกสัญญา
            </p>
            <p>
              <strong><u>.</u></strong
              >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ตามกฎและนโยบายภายใน
              บริษัทจะช่วยลดการบันทึกของผู้ใช้ข้อมูลส่วนบุคคลที่ครั้งหนึ่งเคยเก็บรวบรวมและการใช้งานสำเร็จแล้ว
              อย่างไรก็ตามในกรณีที่บันทึกแล้วจะต้องมีการจัดเก็บไว้ตามนโยบายภายในของบริษัทหรือตามกฎหมายที่เกี่ยวข้อง
              บริษัทขอสงวนสิทธิ์ในการจัดเก็บข้อมูลส่วนบุคคลในช่วงเวลาหนึ่ง
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 10.4&nbsp;
              เมื่อพ้นระยะเวลาการจัดเก็บ หรือ
              เราไม่มีสิทธิหรือไม่สามารถอ้างฐานในการประมวลผลข้อมูลส่วนบุคคลของท่านแล้ว
              เราจะดำเนินการทำลายข้อมูลส่วนบุคคลนั้นให้แล้วเสร็จภายใน 7
              วันนับแต่วันสิ้นสุดระยะเวลาดังกล่าว
            </p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>
            <p><u>ระยะเวลาในการเก็บรักษาข้อมูลส่วนบุคคล</u></p>
            <table>
              <tbody>
                <tr>
                  <td width="75">
                    <p>ลำดับ</p>
                  </td>
                  <td width="325">
                    <p><u>ประเภท/รายการข้อมูลส่วนบุคคล</u></p>
                  </td>
                  <td width="200">
                    <p><u>ระยะเวลาประมวลผล</u></p>
                  </td>
                </tr>
                <tr>
                  <td width="75">
                    <p>1</p>
                  </td>
                  <td width="325">
                    <p>ข้อมูลที่บ่งชี้ตัวตน (ชื่อ&nbsp; เบอร์โทรศัพท์มือถือ เพศ อายุ)</p>
                  </td>
                  <td width="200">
                    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 10 ปีนับแต่วันที่เลิกสัญญา</p>
                    <p>&nbsp;</p>
                  </td>
                </tr>
                <tr>
                  <td width="75">
                    <p>2</p>
                  </td>
                  <td width="325">
                    <p>ข้อมูลการสะสมแต้มคะแนน และสิทธิพิเศษต่างๆ บนแอปพลิเคชั่น</p>
                  </td>
                  <td width="200">
                    <p>
                      1 ปีนับแต่ได้มีการสะสมแต้ม หลังจาก 1
                      ปีจะถูกลบคะแนนออกหรืออาจมีการเปลี่ยนแปลงภายหลัง
                      โดยไม่ต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้า
                    </p>
                    <p>&nbsp;</p>
                  </td>
                </tr>
              </tbody>
            </table>
            <ol start="11">
              <li>
                <strong><u>สิทธิของเจ้าของข้อมูล</u></strong>
              </li>
            </ol>
            <p>ท่านมีสิทธิดำเนินการ ดังต่อไปนี้</p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 11.1
              สิทธิในการเพิกถอนความยินยอม (right to withdraw consent)
              ท่านมีสิทธิในการเพิกถอนความยินยอมในการประมวลผลข้อมูลส่วนบุคคลที่ท่านได้ให้ความยินยอมกับเราได้
              ตลอดระยะเวลาที่ข้อมูลส่วนบุคคลของท่านอยู่กับเรา
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 11.2&nbsp;
              สิทธิในการเข้าถึงข้อมูลส่วนบุคคล (right of access)
              ท่านมีสิทธิในการเข้าถึงข้อมูลส่วนบุคคลของท่านและขอให้เราทำสำเนาข้อมูลส่วนบุคคลดังกล่าวให้แก่ท่าน
              รวมถึงขอให้เราเปิดเผยการได้มาซึ่งข้อมูลส่วนบุคคลที่ท่านมิได้ให้ความยินยอมต่อเราได้
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 11.3&nbsp;
              สิทธิในการแก้ไขข้อมูลส่วนบุคคลให้ถูกต้อง (right to rectification):
              ท่านมีสิทธิในการขอให้เราแก้ไขข้อมูลที่ไม่ถูกต้อง
              หรือเพิ่มเติมข้อมูลที่ไม่สมบูรณ์
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 11.4&nbsp;
              สิทธิในการลบข้อมูลส่วนบุคคล (right to erasure)
              ท่านมีสิทธิในการขอให้เราทำการลบข้อมูลของท่านด้วยเหตุบางประการได้
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 11.5&nbsp;
              สิทธิในการระงับการใช้ข้อมูลส่วนบุคคล (right to restriction of processing)
              ท่านมีสิทธิในการระงับการใช้ข้อมูลส่วนบุคคลของท่านด้วยเหตุบางประการได้
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 11.6&nbsp;
              สิทธิในการโอนย้ายข้อมูลส่วนบุคคล (right to data portability)
              ท่านมีสิทธิในการโอนย้ายข้อมูลส่วนบุคคลของท่านที่ท่านได้ให้ไว้กับเราไปยังผู้ควบคุมข้อมูลรายอื่น
              หรือ ตัวท่านเองด้วยเหตุผลบางประการได้
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 11.7&nbsp;
              สิทธิในการคัดค้านการประมวลผลข้อมูลส่วนบุคคล (right to object)
              ท่านมีสิทธิในการคัดค้านประมวลผลข้อมูลส่วนบุคคลของท่านด้วยเหตุบางประการได้
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              ท่านสามารถติดต่อมายังเจ้าหน้าที่ฝ่ายของเราได้
              เพื่อดำเนินการยื่นคำร้องขอดำเนินการตามสิทธิข้างต้นได้
              (รายละเอียดการติดต่อปรากฏในหัวข้อ &ldquo;ช่องทางการติดต่อ&rdquo;
              ด้านล่างนี้) หรือท่านสามารถศึกษารายละเอียดเงื่อนไข ข้อยกเว้นการใช้สิทธิต่าง
              ๆ ได้ที่ link รายละเอียดการใช้สิทธิ
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ทั้งนี้&nbsp;
              ท่านไม่จำเป็นต้องเสียค่าใช้จ่ายใด ๆ ในการดำเนินการตามสิทธิข้างต้น
              โดยเราจะพิจารณาและแจ้งผลการพิจารณาตามคำร้องของท่านภายใน 30
              วันนับแต่วันที่เราได้รับคำร้องขอดังกล่าว
            </p>
            <ol start="12">
              <li>
                <strong><u>กิจกรรมทางการตลาดและการส่งเสริมการตลาด</u></strong>
              </li>
            </ol>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              ในระหว่างการใช้บริการ&nbsp; เราจะส่งข้อมูลข่าวสารเกี่ยวกับกิจกรรมทางการตลาด
              และการส่งเสริมทางการตลาด&nbsp; ผลิตภัณฑ์&nbsp;
              การให้บริการของเราที่เราคิดว่าท่านอาจสนใจเพื่อประโยชน์ในการให้บริการอย่างเต็มประสิทธิภาพ&nbsp;
              หากท่านได้ตกลงที่จะรับข้อมูลข่าวสารดังกล่าวจากเราแล้ว&nbsp;
              ท่านมีสิทธิยกเลิกความยินยอมดังกล่าวได้ทุกเมื่อ&nbsp;
              โดยท่านสามารถดำเนินการยกเลิกความยินยอมในการรับแจ้งข้อมูลข่าวสารได้
            </p>
            <ol start="13">
              <li>
                <strong><u>การรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคล </u></strong>
              </li>
            </ol>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              เรามีมาตรการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลของท่าน
              ตามมาตรฐานที่กฎหมายกำหนด
              เพื่อป้องกันมิให้ข้อมูลส่วนบุคคลที่ถูกเก็บรวบรวมสูญหายโดยอุบัติเหตุ
              หรือถูกเข้าถึง เปิดเผย หรือแก้ไขเปลี่ยนแปลงโดยปราศอำนาจหรือโดยมิชอบ
              อย่างไรก็ตาม
              เนื่องจากไม่มีวิธีการส่งข้อมูลทางอิเล็กทรอนิกส์หรือวิธีการจัดเก็บข้อมูลที่ปลอดภัยโดยสมบูรณ์
              เราจึงไม่สามารถรับประกันได้ว่าข้อมูลส่วนบุคคลของท่านจะปลอดภัยจากการรบกวนระหว่างการส่งหรือเก็บไว้ในระบบของเรา
              เพื่อช่วยปกป้องความเป็นส่วนตัวและการรักษาความลับของข้อมูลส่วนบุคคลของท่าน&nbsp;
              ความร่วมมือของท่านถือเป็นเรื่องสำคัญอย่างยิ่ง&nbsp;
              โปรดอย่าเปิดเผยรหัสผ่านของท่านแก่ผู้อื่นหรือใช้รหัสผ่านเดียวกันกับที่ท่านใช้สำหรับบริการ<br />
              อื่น ๆ
              และโปรดแจ้งให้เราทราบทันทีในกรณีที่ท่านสงสัยว่ามีการใช้บัญชีของท่านโดยไม่ได้รับอนุญาต
              หรือการละเมิดความปลอดภัยอื่น ๆ
              โดยท่านสามารถแจ้งกับเจ้าหน้าที่เพื่อติดต่อกับเรา&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            </p>
            <ol start="14">
              <li>
                <strong><u>การเปลี่ยนแปลงนโยบายคุ้มครองข้อมูลส่วนบุคคล</u></strong>
              </li>
            </ol>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              เราจะทำการพิจารณาทบทวนนโยบายความเป็นส่วนตัวเป็นประจำเพื่อให้สอดคล้องกับแนวปฏิบัติและกฎหมาย
              ข้อบังคับที่เกี่ยวข้อง ทั้งนี้ หากมีการเปลี่ยนแปลงนโยบายความเป็นส่วนตัว
              เราจะแจ้งให้ท่านทราบด้วยการอัพเดตข้อมูลลงในเว็บไซต์ของเราโดยเร็วที่สุด
            </p>
            <ol start="15">
              <li>
                <strong><u>การแก้ไขนโยบายในการจัดการข้อมูลส่วนบุคคล</u></strong>
              </li>
            </ol>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              หากท่านมีคำถามหากมีการเพิ่ม ลบหรือแก้ไข
              หรือเปลี่ยนแปลงนโยบายในการคุ้มครองข้อมูลส่วนบุคคล จะมีการการแจ้งเตือนในหน้า
              "การแจ้งเตือน" อย่างน้อย 7 วันก่อนที่จะมีการเปลี่ยนแปลงใดๆ
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              อย่างไรก็ตามสำหรับการอัพเดตที่สำคัญที่เกี่ยวข้องกับสิทธิของผู้ใช้ เช่น
              การเก็บ การใช้ประโยชน์หรือการให้ข้อมูลส่วนบุคคลแก่บุคคลที่สาม
              บริษัทจะโพสต์แจ้งเตือนล่วงหน้า 7 วัน
            </p>
            <ol start="16">
              <li>
                <strong><u>การเปลี่ยนแปลงทางเทคนิคในบริการของบริษัท</u></strong>
              </li>
            </ol>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; การสร้างบัญชีของท่าน
              การใช้บริการท่านจะต้องลงทะเบียนชื่อบัญชีและตั้งรหัสผ่าน ให้รายละเอียดต่าง ๆ
              ที่เกี่ยวข้องกับตนเองที่ถูกต้อง สมบูรณ์
              และตรงต่อความเป็นจริงผ่านการลงทะเบียนบนช่องทาง LINE Official Account &ndash;
              ดาคาซี่ แอปพลิเคชัน Customer Relationship Management (CRM Application)
              (&ldquo;บัญชีผู้ใช้&rdquo;)
              และแก้ไขบัญชีผู้ใช้ให้ถูกต้องและตรงต่อความเป็นจริงในปัจจุบันอยู่เสมอ
              กรณีที่บริษัทฯ ตรวจสอบและพบว่าท่านให้ข้อมูลที่เป็นเท็จ บริษัทฯ
              ขอสงวนสิทธิที่จะระงับหรือเพิกถอนบัญชีหรือระงับการใช้บริการของท่านได้ทันที
              ซึ่งท่านต้องรับผิดชอบทุกการกระทำภายใต้การใช้บัญชีและรักษารหัสผ่านของท่าน
              หากพบว่ามีบุคคลอื่นใช้บัญชีของท่านโดยไม่ได้รับอนุญาต
              ท่านต้องรายงานให้บริษัทฯ ทราบทันที ทั้งนี้ บริษัทฯ
              ขอสงวนสิทธิในการรับผิดชอบต่อบัญชี หรือรหัสผ่านของท่านกับบุคคลอื่น
              ในกรณีที่บริษัทฯ ได้ใช้ความเชี่ยวชาญและความระมัดระวังตามสมควรแล้ว
              หากเกิดการใช้บัญชีของท่านโดยไม่ได้รับอนุญาต อันเนื่องมาจากบุคคลอื่น บริษัทฯ
              มีสิทธิเพิกถอนหรือระงับการใช้บัญชีของท่าน
            </p>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              จากการที่ท่านหรือบุคคลอื่นกระทำการละเมิดเงื่อนไขของบริษัท
               ท่านรับทราบและเข้าใจดีว่า บุคคลธรรมดา และ/หรือ นิติบุคคล
              แต่ละรายจะต้องมีบัญชีผู้ใช้เพียง 1 (หนึ่ง) บัญชี
              หากบริษัทพบว่าบุคคลใดทำการสมัคร หรือใช้งานบัญชีผู้ใช้มากกว่า 1 (หนึ่ง) บัญชี
              บริษัทมีสิทธิโดยชอบในการลบบัญชี
              หรือเพิกถอนบัญชีผู้ใช้งานของท่านและในกรณีนี้ถือว่าดุลพินิจของบริษัทเป็นที่สิ้นสุด
            </p>
            <p>&nbsp;</p>
            <ol start="17">
              <li>
                <strong><u>ทรัพย์สินทางปัญญา</u></strong>
              </li>
            </ol>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              เนื้อหาทั้งหมดที่มีในบริการของบริษัทฯ เช่น เนื้อหา ข้อความ กราฟฟิก โลโก้
              ปุ่มไอคอน รูปภาพ วิดีโอ การถ่ายทอดสด และอื่น ๆ โดยรวม
              อีกทั้งซอฟต์แวร์ที่ใช้ในแอปพลิเคชันล้วนเป็นทรัพย์สินของ<br />
              บริษัทฯ หรือบริษัทคู่ค้าที่เกี่ยวข้อง
              ซึ่งได้รับความคุ้มครองภายใต้กฎหมายไทยและกฎหมายสากลอย่าง<br />
              ไม่จำกัด ว่าด้วยลิขสิทธิ์และกฎหมายอื่น ๆ
              ที่คุ้มครองทรัพย์สินทางปัญญาและสิทธิของบริษัทฯ
              ท่านตกลงที่จะไม่ละเมิดลิขสิทธิ์และปฏิบัติตามกฎหมายอื่น ๆ
              ข้อมูลและข้อจำกัดที่มีอยู่ในเนื้อหาใด ๆ
              ที่เข้าถึงได้ผ่านทางเว็บไซต์และแอปพลิเคชัน
              ท่านยินยอมที่จะคอยติดตามและปฏิบัติตามกฎหมายลิขสิทธิ์และกฎหมายอื่น ๆ
              รวมถึงคำบรรยายหรือข้อบังคับอื่น ๆ ที่ปรากฏอยู่ในเนื้อหา
              และจะไม่ทำการเปลี่ยนแปลงเนื้อหาดังกล่าวที่บริษัทฯ
              หรือบุคคลอื่นเป็นเจ้าของลิขสิทธิ์อย่างไม่จำกัดในเนื้อหานั้น
              หากมิได้รับอนุญาตจากเจ้าของลิขสิทธิ์
              ท่านเห็นด้วยว่าท่านไม่สามารถครอบครองสิทธิ์ความเป็นเจ้าของ
              ในการดาวน์โหลดเนื้อหานั้น ๆ ผ่านบริการทางไลน์ เว็บไซต์และแอปพลิเคชัน
              หากมิได้มีการกำหนดไว้ตามกฎหมายหรือมิได้รับอนุญาตจากเงื่อนไขการให้บริการของทางไลน์
              เว็บไซต์และแอปพลิเคชัน รวมถึงท่านไม่สามารถดัดแปลง
              ใช้วิธีวิศวกรรมย้อนกลับเพื่อทำขึ้นมาใหม่ เผยแพร่ ส่งผ่าน จัดแสดง
              มีส่วนร่วมในการขาย สร้างผลงานลอกเลียนแบบ
              หรือหาผลประโยชน์ในทางพาณิชย์กับบุคคลที่อื่นจากไลน์
              เว็บไซต์และแอปพลิเคชันทั้งหมดหรือบางส่วนโดยมิได้รับอนุญาตอย่างชัดเจนจากบริษัทฯ
              และเจ้าของผลงานนั้น ๆ เราไม่อนุญาตท่านให้ใช้ทรัพย์สินทางปัญญาของบริษัทฯ
              หรือทรัพย์สินทางปัญญาที่บริษัทฯ ได้รับอนุญาตให้ใช้สิทธิ
              ยกเว้นกรณีที่ได้รับอนุญาตตามเงื่อนไขแห่งสัญญานี้
            </p>
            <ol start="18">
              <li>
                <strong><u>ข้อมูลความเป็นส่วนตัว</u></strong>
              </li>
            </ol>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              ข้อมูลทั้งหมดที่ให้ไว้โดยท่านหรือที่เก็บรวบรวมโดยบริษัทฯ
              ในการเชื่อมต่อกับบริการจะเป็นไปตามนโยบายการจัดเก็บข้อมูลส่าวนบุคคลของบริษัทฯ
              บริษัทฯ อาจใช้ข้อมูลที่ได้รับหรือเก็บรวบรวมเกี่ยวกับการใช้งาน
              ระยะเวลาการใช้งาน ประเภทของผลงานภายใต้เงื่อนไขนโยบายความเป็นส่วนตัว
              โดยบริษัทฯ
              ใช้ข้อมูลดังกล่าวเพื่อวัตถุประสงค์ทางการตลาดหรือโฆษณาเหตุการณ์หรือบริการอื่น
              ๆ ที่อาจเป็นที่สนใจของท่าน นอกจากนี้ข้อมูลที่ส่งหรือที่ท่านให้แก่บริษัทฯ
              ที่ประชาชนทั่วไปอาจสามารถเข้าถึงข้อมูลนั้นได้
              ท่านควรรักษาข้อมูลเป็นอย่างดีเพื่อรักษาข้อมูลส่วนตัวหรือข้อมูลที่มีความสำคัญกับท่าน
            </p>
            <ol start="19">
              <li>
                <strong><u>เงื่อนไขอื่นๆ</u></strong>
              </li>
            </ol>
            <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              การที่ท่านเข้าใช้หรือเข้าถึงไลน์ แอปพลิเคชั่นของบริษัทฯ
              ถือเป็นการยอมรับว่าจะปฏิบัติตามระเบียบข้อบังคับการใช้บริการตามเงื่อนไขข้างต้นทุกประการ
              และจะมีผลผูกพันตามเงื่อนไขของบริษัทฯ
              ในความรับผิดต่อความเสียหายจากการใช้หรือเข้าถึงไลน์
              เว็บไซต์หรือเว็บไซต์และแอปพลิเคชัน ในกรณีที่ข้อความหรือส่วนใด ๆ
              ของเงื่อนไขนี้ไม่สมบูรณ์ ผิดกฎหมายหรือไม่อาจใช้บังคับได้
              ให้ถือว่าข้อความส่วนนั้น ๆ แยกออกจากส่วนที่เหลือของสัญญาฉบับนี้
              โดยข้อความหรือส่วนนั้น ๆ จะไม่มีผลกระทบต่อความสมบูรณ์
              &nbsp;ความถูกต้องตามกฎหมาย หรือการใช้บังคับของส่วนที่เหลือของเงื่อนไขฉบับนี้
            </p>
            <ol start="20">
              <li>
                <strong><u>ช่องทางการติดต่อ</u></strong>
              </li>
            </ol>
            <p>
              <strong><u>รายละเอียดผู้ควบคุมข้อมูล</u></strong>
            </p>
            <p>
              ชื่อ&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; บริษัท มิกซ์เซี่ยน ฟู้ดส์ จำกัด
            </p>
            <p>
              สถานที่ติดต่อ&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; เลขที่&nbsp;1550 อาคารธนภูมิ
              ยูนิต ซี2,ดี ชั้น10 ถนนเพชรบุรีตัดใหม่ แขวงมักกะสัน เขตราชเทวี กทม.
            </p>
            <p>e-mail ติดต่อ: &nbsp;MKT@MIXXIONFOODS.COM.</p>
            <p>&nbsp;</p>
          </div>
        </v-card-text>

        <v-divider></v-divider>
      </v-card>
    </v-dialog>
  </div>
</template>
<script>
export default {
  data() {
    return {
      dialog: false,
    };
  },

  props: {
    show: {
      type: Boolean,
      required: true,
      default() {
        return false;
      },
    },
  },

  mounted() {},

  watch: {
    show: {
      deep: true,
      handler(n, o) {
        this.dialog = n;
      },
    },
  },
  methods: {
    close() {
      this.dialog = false;
      this.$emit("close", this.dialog);
    },
  },
};
</script>
